system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

setFormat raw; 

interpolationScheme cellPoint; 

sets 
 ( 
    profile_-1.6
    { 
        type        uniform; 
        axis        y; 
        start       (0.9 -0.7200000000000001 -0.72);
        end         (0.9 0.7200000000000001 -0.72);
        nPoints     41;
    }

    profile_-1.44
    { 
        type        uniform; 
        axis        y; 
        start       (0.9 -0.7200000000000001 -0.648);
        end         (0.9 0.7200000000000001 -0.648);
        nPoints     41;
    }

    profile_-1.28
    { 
        type        uniform; 
        axis        y; 
        start       (0.9 -0.7200000000000001 -0.576);
        end         (0.9 0.7200000000000001 -0.576);
        nPoints     41;
    }

    profile_-1.12
    { 
        type        uniform; 
        axis        y; 
        start       (0.9 -0.7200000000000001 -0.504);
        end         (0.9 0.7200000000000001 -0.504);
        nPoints     41;
    }

    profile_-0.96
    { 
        type        uniform; 
        axis        y; 
        start       (0.9 -0.7200000000000001 -0.432);
        end         (0.9 0.7200000000000001 -0.432);
        nPoints     41;
    }

    profile_-0.8
    { 
        type        uniform; 
        axis        y; 
        start       (0.9 -0.7200000000000001 -0.36);
        end         (0.9 0.7200000000000001 -0.36);
        nPoints     41;
    }

    profile_-0.64
    { 
        type        uniform; 
        axis        y; 
        start       (0.9 -0.7200000000000001 -0.288);
        end         (0.9 0.7200000000000001 -0.288);
        nPoints     41;
    }

    profile_-0.48
    { 
        type        uniform; 
        axis        y; 
        start       (0.9 -0.7200000000000001 -0.216);
        end         (0.9 0.7200000000000001 -0.216);
        nPoints     41;
    }

    profile_-0.32
    { 
        type        uniform; 
        axis        y; 
        start       (0.9 -0.7200000000000001 -0.144);
        end         (0.9 0.7200000000000001 -0.144);
        nPoints     41;
    }

    profile_-0.16
    { 
        type        uniform; 
        axis        y; 
        start       (0.9 -0.7200000000000001 -0.072);
        end         (0.9 0.7200000000000001 -0.072);
        nPoints     41;
    }

    profile_0.0
    { 
        type        uniform; 
        axis        y; 
        start       (0.9 -0.7200000000000001 0.0);
        end         (0.9 0.7200000000000001 0.0);
        nPoints     41;
    }

    profile_0.16
    { 
        type        uniform; 
        axis        y; 
        start       (0.9 -0.7200000000000001 0.072);
        end         (0.9 0.7200000000000001 0.072);
        nPoints     41;
    }

    profile_0.32
    { 
        type        uniform; 
        axis        y; 
        start       (0.9 -0.7200000000000001 0.144);
        end         (0.9 0.7200000000000001 0.144);
        nPoints     41;
    }

    profile_0.48
    { 
        type        uniform; 
        axis        y; 
        start       (0.9 -0.7200000000000001 0.216);
        end         (0.9 0.7200000000000001 0.216);
        nPoints     41;
    }

    profile_0.64
    { 
        type        uniform; 
        axis        y; 
        start       (0.9 -0.7200000000000001 0.288);
        end         (0.9 0.7200000000000001 0.288);
        nPoints     41;
    }

    profile_0.8
    { 
        type        uniform; 
        axis        y; 
        start       (0.9 -0.7200000000000001 0.36);
        end         (0.9 0.7200000000000001 0.36);
        nPoints     41;
    }

    profile_0.96
    { 
        type        uniform; 
        axis        y; 
        start       (0.9 -0.7200000000000001 0.432);
        end         (0.9 0.7200000000000001 0.432);
        nPoints     41;
    }

    profile_1.12
    { 
        type        uniform; 
        axis        y; 
        start       (0.9 -0.7200000000000001 0.504);
        end         (0.9 0.7200000000000001 0.504);
        nPoints     41;
    }

    profile_1.28
    { 
        type        uniform; 
        axis        y; 
        start       (0.9 -0.7200000000000001 0.576);
        end         (0.9 0.7200000000000001 0.576);
        nPoints     41;
    }

    profile_1.44
    { 
        type        uniform; 
        axis        y; 
        start       (0.9 -0.7200000000000001 0.648);
        end         (0.9 0.7200000000000001 0.648);
        nPoints     41;
    }

    profile_1.6
    { 
        type        uniform; 
        axis        y; 
        start       (0.9 -0.7200000000000001 0.72);
        end         (0.9 0.7200000000000001 0.72);
        nPoints     41;
    }

);

fields 
(
    U
    vorticity
); 

// *********************************************************************** // 
